In [1]:
#Programmer: Mahek Suhail Shaikh
#College: Keystone School Of Engineering ,Pune
#Class:TE-B
#RollNo: 29

In [2]:
#Pandas: structured data analysis
import pandas as pd

In [4]:
df=pd.read_csv('student.csv')
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [5]:
#Slicing = extracting specific num of data i.e row,cols
#types 1)index based  2)label based

In [6]:
#Index based Slicing 
#Syntax=df.iloc[row seq,col seq]
#keyword(iloc)=allows the selection and retrieval of specific rows and columns in DataFrames

In [7]:
x=df.iloc[4:9,1:4] #in row seq(4:9)from 4th row to 8th, in col seq(1:4) from col 1 to 3
x

     name class  marks
4    asha    TE  63.28
5  ayesha    BE  49.55
6    amar    BE  65.34
7   amita    BE  68.33
8    amol    TE  56.75

In [10]:
x1=df.iloc[:9,:4]
x1
#no start index given gives whole some start output

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [11]:
x2=df.iloc[1:,2:]
x2
#no end index given gives whole some till end output

  class  marks  age
1    TE  59.77   21
2    BE  76.88   19
3    TE  69.66   20
4    TE  63.28   20
5    BE  49.55   20
6    BE  65.34   19
7    BE  68.33   23
8    TE  56.75   20
9    BE  78.66   21

In [12]:
x3=df.iloc[:,:]
x3
#no  index mentioned gives whole some  output

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [13]:
#df.iloc[3:7] only rows
#df.iloc[1:3] only columns
# mentioning rows is important *

In [16]:
#prob with slicing  data is accesed in seq order to overcome it need to add list of order manually but it should be in alloted range
df.iloc[[3,6,4,1,2],:] #the fashion mentioned here is followed

   roll     name class  marks  age
3     4  ajinkya    TE  69.66   20
6     7     amar    BE  65.34   19
4     5     asha    TE  63.28   20
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19

In [17]:
df.iloc[[5,7,4],[3,2]]

   marks class
5  49.55    BE
7  68.33    BE
4  63.28    TE

In [19]:
df.iloc[:,[3,1]]#the fashion of cols#the fashion mentioned here is followed  mentioned here is followed

   marks     name
0  56.77     anil
1  59.77     amit
2  76.88   aniket
3  69.66  ajinkya
4  63.28     asha
5  49.55   ayesha
6  65.34     amar
7  68.33    amita
8  56.75     amol
9  78.66    anmol

In [25]:
df.iloc[7,:] #or df.iloc[5]
#mentioning row is imp

roll         8
name     amita
class       BE
marks    68.33
age         23
Name: 7, dtype: object

In [24]:
df.iloc[:,1] #series of exactly 1 col

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [26]:
df.iloc[2,1] #row 2 col 1 fetches the value

'aniket'

In [30]:
#label based =where we use name of the cols
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [31]:
df.loc[:,['name','age']] #for multiple cols presentation

      name  age
0     anil   22
1     amit   21
2   aniket   19
3  ajinkya   20
4     asha   20
5   ayesha   20
6     amar   19
7    amita   23
8     amol   20
9    anmol   21

In [33]:
#magic- we can print specific col by its name with no use of loc attr
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [34]:
df[['name','age']] #for multiple cols by simply adding list of cols  in between

      name  age
0     anil   22
1     amit   21
2   aniket   19
3  ajinkya   20
4     asha   20
5   ayesha   20
6     amar   19
7    amita   23
8     amol   20
9    anmol   21

In [37]:
#access one col and every row
#prob= only single col can be accessed 
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [44]:
df.iloc[list(range(5))+list(range(6,8))] #skip row 5 work till 8th row

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23

In [45]:
df.drop(5) #skip row 5

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [47]:
df.drop([4,7]) #skip multiple rows

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [50]:
#axis=vertical=cols(1) & horizontal =rows(0)
#some funct in pandas works on cols and some on rows
#if need to exchange them need to aad 'axis' parameter
df.drop('class',axis=1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [54]:
df.drop(['class','name'],axis=1)

   roll  marks  age
0     1  56.77   22
1     2  59.77   21
2     3  76.88   19
3     4  69.66   20
4     5  63.28   20
5     6  49.55   20
6     7  65.34   19
7     8  68.33   23
8     9  56.75   20
9    10  78.66   21

Functions /methods

In [ ]:
#these will be workin on cols by-default

In [56]:
df['marks'].mean()

64.499

In [65]:
df['marks'].median()
#sort data ->center value (odd)
#sort data ->avg of two center value (even)

64.31

In [66]:
df['marks'].mode()
#we get such op coz mode is applicable for only categorical data and those are ordinal,nominal,discrete

0    49.55
1    56.75
2    56.77
3    59.77
4    63.28
5    65.34
6    68.33
7    69.66
8    76.88
9    78.66
Name: marks, dtype: float64

In [74]:
df['age'].mode()

0    20
Name: age, dtype: int64

In [ ]:
df['marks'].std()
#avg dist of every point from mean

In [57]:
df['marks'].max()

78.66

In [58]:
df['marks'].min()

49.55

In [59]:
df['marks'].sum()

644.9899999999999

In [60]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [61]:
#for strings
df['name'].max()
#op is ayesha why -> checks the alpha order degree

'ayesha'

In [62]:
df['name'].min()

'ajinkya'

In [63]:
df['name'].sum()

'anilamitaniketajinkyaashaayeshaamaramitaamolanmol'

In [67]:
df['marks'].var()
#the avg of the squared distance from each point to the mean.

84.7721433333333

In [68]:
#Qualitative-can't used in arithmetic eq(cannot measure)
#   - nominal-general purpose str(address,name)
#   - ordinal-str can be order enumerable like (good,better,best)

#Quantitative-can be used in arithmetic eq(measurable)
#   -discrete- num cant be floating (rollnums,num of students)
#   -continous- data can contain floating points(sqrt of area,height 5.2)

#Categorical data ->ordinal/discrete class is categorical and age is categorical (kinda limit)

In [69]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [71]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [72]:
df['name'].count()

10

In [75]:
df.min() #min val from every col is taken

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [76]:
#df.mean(),df.median(),df.std() ->error strings encountered
df.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [ ]:
#by mentioning axis=1 the functions will work upon rows

In [77]:
df.mean(numeric_only=True,axis=1)

0    26.590000
1    27.590000
2    32.960000
3    31.220000
4    29.426667
5    25.183333
6    30.446667
7    33.110000
8    28.583333
9    36.553333
dtype: float64

In [78]:
#Summarised format of dataset

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [80]:
df.describe()
#whats 25% 50% its quartiles 
#quartile are parts after sorting dataset dividation(halves) into lower upper and mid

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000